backend/app/controllers/api/books_controller.rb

SELECT `books`.* FROM `books`
---
  def index
    books = Book.all

SELECT `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
---
  def show
    book = Book.find(params[:id])

INSERT INTO `books` (`title`, `author`, `publisher`, `genre`, `created_at`, `updated_at`) VALUES ('aaaa', 'ssdsa', 'dsdsdsa', 'dadadasad', '2023-09-19 10:26:46.571355', '2023-09-19 10:26:46.571355')
---
  def create
    @book = Book.new(book_params)
    if @book.save

SELECT `books`.* FROM `books` WHERE `books`.`id` = 4 LIMIT 1
UPDATE `books` SET `books`.`publisher` = 'kodudoasdoa', `books`.`updated_at` = '2023-09-30 15:35:50.994571' WHERE `books`.`id` = 1
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)

SELECT `books`.* FROM `books` WHERE `books`.`id` = 22 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 22
---
  def destroy
    @book = Book.find(params[:id])
    if @book.destroy